# Unfortunately, this file does not allow pinning of versions for every
# package. Thus, some have versions and some do not.
tap "homebrew/bundle"
tap "mongodb/brew"

brew "argo"
brew "awscli"
brew "bazelisk"
brew "biber"
brew "fzf"
brew "geckodriver"
brew "git"
brew "go@1.19"
brew "graphviz"
brew "grep"
brew "gnupg"
brew "hashicorp/tap/terraform-ls"
brew "helm"
brew "helmfile"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "maven"
brew "mongodb-community@7.0"
brew "neovim"
brew "netcat"
brew "nmap"
# Node is needed by nvim.
# nvm install <latest lts>
brew "nvm"
brew "openjdk"
brew "pipx"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "redis"
brew "stow"
brew "tfenv"
brew "tmux"
brew "tree"
brew "telnet"
brew "texlab"
brew "yarn"
brew "vault"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password/tap/1password-cli"
cask "basictex"
cask "discord"
cask "docker"
cask "firefox"
cask "google-cloud-sdk"
cask "hammerspoon"
cask "keybase"
