tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/core"
brew "awscli"
brew "bazelisk"
brew "fzf"
brew "git"
brew "go@1.19", link: true
brew "hashicorp/tap/terraform-ls"
brew "jq"
brew "maven@3.8"
brew "neovim"
brew "node"
brew "nvm"
brew "openjdk@18"
brew "pre-commit@2.19.0"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ripgrep"
brew "stow"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "derailed/k9s/k9s"
